app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `correo` = 'jovani90.jdt@gmail.com'
 LIMIT 1
---
    public function authenticate() {
        $model = new UsuarioModel();
        $correo = $this->request->getPost('correo');
        $contraseña = $this->request->getPost('contraseña');

        $usuario = $model->where('correo', $correo)->first();